/*
Бухгалтерский учет

На Галлифрее в году m месяцев, в каждом месяце n дней. 
Вам известно количество денег, которое заработала некая компания 
в каждый день года. Вам требуется для каждого месяца найти 
суммарную выручку компании за этот месяц.

Входные данные

Первая строка входных данных содержит два целых числа n, m (1≤n,m≤500) - 
количество дней в месяце и количество месяцев в году соответственно.

В следующих n строках записано по m чисел. 
Число, записанное в i-й строке на j-й позиции, 
обозначает количество денег, которое заработала 
компания в i-й день j-о месяца.
Все числа в массиве целые, 
и по модулю не превосходят 10 в степени 9 по модулю.

Выходные данные 

Выведите m чисел - суммарную выручку компании в каждый месяц.

Sample Input 1:

3 4
7 2 4 3
9 3 3 6
2 7 8 9
Sample Output 1:

18 12 15 18 

*/

#include <iostream>

using namespace std;

int main(){
    int n, m;
    long sum;
    cin >> n >> m;
    long a[n][m];
    sum = 0;
    
    for (int i = 0; i < n; i++) {
        for (int j = 0; j < m; j++) {
            cin >> a[i][j]; 
        }
    }
    
    
    
    for (int j = 0; j < m; j++) {
        for (int i = 0; i < n; i++) {
            sum = sum + a[i][j]; 
        }
        cout << sum << ' ';
        sum = 0;
    }
}